Resources/OpenFOAM_Case/pitzDailyLESDevelopedInlet-OF11/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            mappedInternal;
        inGroups        List<word> 1(mappedInternal);
        nFaces          30;
        startFace       27238;
        offsetMode      direction;
        offset          (0.0495 0 0);
    }
    outlet
    {
        type            patch;
        nFaces          57;
        startFace       27268;
    }
    upperWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          275;
        startFace       27325;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          302;
        startFace       27600;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          27570;
        startFace       27902;
    }
)

// ************************************************************************* //
